str1 = str("Значимость этих проблем настолько очевидна, что постоянный количественный рост и сфера нашей активности представляет собой интересный эксперимент проверки экономической целесообразности принимаемых решений. Повседневная практика показывает, что консультация с профессионалами из IT позволяет оценить значение существующих финансовых и административных условий. Не следует, однако, забывать о том, что курс на социально-ориентированный национальный проект требует от нас системного анализа ключевых компонентов планируемого обновления.")

print(str1.find(".")) 
print(str1[14:].find("."))
print(str1[str1.find(".")+1 : str1.find(".", )+3])
 



























